/*!--------------------------------------------------------
 * Copyright (C) Microsoft Corporation. All rights reserved.
 *--------------------------------------------------------*/
define("vs/workbench/node/extensionHostProcess.nls.ru", {
  "vs/base/common/severity": ["Ошибка", "Предупреждение", "Сведения"],
  "vs/base/node/processes": ["Невозможно выполнить команду оболочки на диске UNC."],
  "vs/editor/common/config/editorOptions": ["Редактор сейчас недоступен. Чтобы открыть список действий, нажмите ALT+F1.", "Содержимое редактора"],
  "vs/editor/common/modes/modesRegistry": ["Обычный текст"],
  "vs/platform/configuration/common/configurationRegistry": ["Переопределения конфигурации по умолчанию", "Настройка переопределяемых параметров редактора для языка {0}.", "Настройка параметров редактора, переопределяемых для языка.", "Невозможно зарегистрировать \"{0}\". Оно соответствует шаблону свойства '\\\\[.*\\\\]$' для описания параметров редактора, определяемых языком. Используйте участие configurationDefaults.", 'Невозможно зарегистрировать "{0}". Это свойство уже зарегистрировано.'],
  "vs/platform/workspaces/common/workspaces": ["Рабочая область кода", "(Рабочая область) без названия", "{0} (рабочая область)", "{0} (рабочая область)"],
  "vs/workbench/api/node/extHostDiagnostics": ["Не отображается еще несколько ошибок и предупреждений ({0})."],
  "vs/workbench/api/node/extHostExtensionActivator": ['Не удалось активировать расширение "{1}". Причина: неизвестный зависимый компонент "{0}".', 'Не удалось активировать расширение "{1}". Причина: ошибка активации зависимого компонента "{0}".', 'Не удалось активировать расширение "{0}". Причина: более 10 уровней зависимостей (скорее всего, цикл зависимостей).', 'Ошибка активации расширения "{0}": {1}.'],
  "vs/workbench/api/node/extHostTask": ["{0}: {1}"],
  "vs/workbench/api/node/extHostTreeViews": ["Отсутствует зарегистрированное представление в виде дерева с идентификатором '{0}'.", "Отсутствует зарегистрированное представление в виде дерева с идентификатором '{0}'.", "Отсутствует элемент дерева с идентификатором '{0}'."],
  "vs/workbench/node/extensionHostMain": ['Путь "{0}" не указывает на допустимый модуль выполнения тестов расширения.']
});
//# sourceMappingURL=https://ticino.blob.core.windows.net/sourcemaps/ca023a700f35212071dfe9544272719cbbf80e4c/core/vs\workbench\node\extensionHostProcess.nls.ru.js.map